Revit 2026 API

# Solid Methods

---

The Solid type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | ComputeCentroid | Returns the Centroid of this solid. |
|  | Dispose | Causes the object to release immediately any resources it may be utilizing.(Inherited from APIObject) |
|  | Equals | Determines whether the specified Object is equal to the current Object. (Inherited from GeometryObject) |
|  | GetBoundingBox | Retrieves a box that circumscribes the solid geometry. |
|  | GetHashCode | Gets the integer value of the geometry object as hash code (Inherited from GeometryObject) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | IntersectWithCurve | Calculates and returns the intersection between a curve and this solid. |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

Solid Class

Autodesk.Revit.DB Namespace